Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK0512GC01100.atdf
        <register name="CAN_TXBE_1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Tx Buffer Element 1">
          <bitfield name="DLC" caption="Identifier" mask="0xF0000"/>
          <bitfield name="BRS" caption="Bit Rate Search" mask="0x100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x200000"/>
          <bitfield name="EFC" caption="Event FIFO Control" mask="0x800000"/>
          <bitfield name="MM" caption="Message Marker" mask="0xFF000000"/>
        </register>
        <register name="CAN_TXBE_DATA" offset="0x8" rw="RW" size="4" count="16" initval="0x00000000" caption="Tx Buffer Element Data">
          <bitfield name="DB0" caption="Data Byte 0" mask="0xFF"/>
          <bitfield name="DB1" caption="Data Byte 1" mask="0xFF00"/>
          <bitfield name="DB2" caption="Data Byte 2" mask="0xFF0000"/>
          <bitfield name="DB3" caption="Data Byte 3" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_TXEFE" caption="Tx Event FIFO Element" aligned="4">
        <register name="CAN_TXEFE_0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Tx Event FIFO Element 0">
          <bitfield name="ID" caption="Identifier" mask="0x1FFFFFFF"/>
          <bitfield name="RTR" caption="Remote Transmission Request" mask="0x20000000"/>
          <bitfield name="XTD" caption="Extended Indentifier" mask="0x40000000"/>
          <bitfield name="ESI" caption="Error State Indicator" mask="0x80000000"/>
        </register>
        <register name="CAN_TXEFE_1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Tx Event FIFO Element 1">
          <bitfield name="TXTS" caption="Tx Timestamp" mask="0xFFFF"/>
          <bitfield name="DLC" caption="Data Length Code" mask="0xF0000"/>
          <bitfield name="BRS" caption="Bit Rate Search" mask="0x100000"/>
          <bitfield name="FDF" caption="FD Format" mask="0x200000"/>
          <bitfield name="ET" caption="Event Type" mask="0xC00000" values="CAN_TXEFE_1__ET"/>
          <bitfield name="MM" caption="Message Marker" mask="0xFF000000"/>
        </register>
      </register-group>
      <register-group name="CAN_XIDFE" caption="Extended Message ID Filter Element" aligned="4">
        <register name="CAN_XIDFE_0" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Extended Message ID Filter Element 0">
          <bitfield name="EFID1" caption="Extended Filter ID 1" mask="0x1FFFFFFF"/>
          <bitfield name="EFEC" caption="Extended Filter Element Configuration" mask="0xE0000000" values="CAN_XIDFE_0__EFEC"/>
        </register>
        <register name="CAN_XIDFE_1" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Extended Message ID Filter Element 1">
          <bitfield name="EFID2" caption="Extended Filter ID 2" mask="0x1FFFFFFF"/>
          <bitfield name="EFT" caption="Extended Filter Type" mask="0xC0000000" values="CAN_XIDFE_1__EFT"/>
        </register>
      </register-group>
      <value-group name="TEST__TX">
        <value name="CORE" caption="TX controlled by CAN core" value="0"/>
        <value name="SAMPLE" caption="TX monitoring sample point" value="1"/>
        <value name="DOMINANT" caption="Dominant (0) level at pin CAN_TX" value="2"/>
        <value name="RECESSIVE" caption="Recessive (1) level at pin CAN_TX" value="3"/>
      </value-group>
      <value-group name="TSCC__TSS">
        <value name="ZERO" caption="Timestamp counter value always 0x0000" value="0"/>
        <value name="INC" caption="Timestamp counter value incremented by TCP" value="1"/>
      </value-group>
      <value-group name="TOCC__TOS">
        <value name="CONT" caption="Continuout operation" value="0"/>
        <value name="TXEF" caption="Timeout controlled by TX Event FIFO" value="1"/>
        <value name="RXF0" caption="Timeout controlled by Rx FIFO 0" value="2"/>
        <value name="RXF1" caption="Timeout controlled by Rx FIFO 1" value="3"/>
      </value-group>
      <value-group name="PSR__LEC">
        <value name="NONE" caption="No Error" value="0"/>
        <value name="STUFF" caption="Stuff Error" value="1"/>
        <value name="FORM" caption="Form Error" value="2"/>
        <value name="ACK" caption="Ack Error" value="3"/>
        <value name="BIT1" caption="Bit1 Error" value="4"/>
        <value name="BIT0" caption="Bit0 Error" value="5"/>
        <value name="CRC" caption="CRC Error" value="6"/>
        <value name="NC" caption="No Change" value="7"/>
      </value-group>
      <value-group name="PSR__ACT">
        <value name="SYNC" caption="Node is synchronizing on CAN communication" value="0"/>
        <value name="IDLE" caption="Node is neither receiver nor transmitter" value="1"/>
        <value name="RX" caption="Node is operating as receiver" value="2"/>
        <value name="TX" caption="Node is operating as transmitter" value="3"/>
      </value-group>
      <value-group name="PSR__DLEC">
        <value name="NONE" caption="No Error" value="0"/>
        <value name="STUFF" caption="Stuff Error" value="1"/>
        <value name="FORM" caption="Form Error" value="2"/>
        <value name="ACK" caption="Ack Error" value="3"/>
        <value name="BIT1" caption="Bit1 Error" value="4"/>
        <value name="BIT0" caption="Bit0 Error" value="5"/>
        <value name="CRC" caption="CRC Error" value="6"/>
        <value name="NC" caption="No Change" value="7"/>
      </value-group>
      <value-group name="GFC__ANFE">
        <value name="RXF0" caption="Accept in Rx FIFO 0" value="0"/>
        <value name="RXF1" caption="Accept in Rx FIFO 1" value="1"/>
        <value name="REJECT" caption="Reject" value="2"/>
      </value-group>
      <value-group name="GFC__ANFS">
        <value name="RXF0" caption="Accept in Rx FIFO 0" value="0"/>
        <value name="RXF1" caption="Accept in Rx FIFO 1" value="1"/>
        <value name="REJECT" caption="Reject" value="2"/>
      </value-group>
      <value-group name="HPMS__MSI">
        <value name="NONE" caption="No FIFO selected" value="0"/>
        <value name="LOST" caption="FIFO message lost" value="1"/>
        <value name="FIFO0" caption="Message stored in FIFO 0" value="2"/>
        <value name="FIFO1" caption="Message stored in FIFO 1" value="3"/>
      </value-group>
      <value-group name="RXF1S__DMS">
        <value name="IDLE" caption="Idle state" value="0"/>
        <value name="DBGA" caption="Debug message A received" value="1"/>
        <value name="DBGB" caption="Debug message A/B received" value="2"/>
        <value name="DBGC" caption="Debug message A/B/C received, DMA request set" value="3"/>
      </value-group>
      <value-group name="RXESC__F0DS">
        <value name="DATA8" caption="8 byte data field" value="0"/>
        <value name="DATA12" caption="12 byte data field" value="1"/>
        <value name="DATA16" caption="16 byte data field" value="2"/>
        <value name="DATA20" caption="20 byte data field" value="3"/>
        <value name="DATA24" caption="24 byte data field" value="4"/>
        <value name="DATA32" caption="32 byte data field" value="5"/>
        <value name="DATA48" caption="48 byte data field" value="6"/>
        <value name="DATA64" caption="64 byte data field" value="7"/>
      </value-group>
      <value-group name="RXESC__F1DS">
        <value name="DATA8" caption="8 byte data field" value="0"/>
        <value name="DATA12" caption="12 byte data field" value="1"/>
        <value name="DATA16" caption="16 byte data field" value="2"/>
        <value name="DATA20" caption="20 byte data field" value="3"/>
        <value name="DATA24" caption="24 byte data field" value="4"/>
        <value name="DATA32" caption="32 byte data field" value="5"/>
        <value name="DATA48" caption="48 byte data field" value="6"/>
        <value name="DATA64" caption="64 byte data field" value="7"/>
      </value-group>
      <value-group name="RXESC__RBDS">
        <value name="DATA8" caption="8 byte data field" value="0"/>
        <value name="DATA12" caption="12 byte data field" value="1"/>
        <value name="DATA16" caption="16 byte data field" value="2"/>
        <value name="DATA20" caption="20 byte data field" value="3"/>
        <value name="DATA24" caption="24 byte data field" value="4"/>
        <value name="DATA32" caption="32 byte data field" value="5"/>
        <value name="DATA48" caption="48 byte data field" value="6"/>
        <value name="DATA64" caption="64 byte data field" value="7"/>
      </value-group>
      <value-group name="TXESC__TBDS">
        <value name="DATA8" caption="8 byte data field" value="0"/>
        <value name="DATA12" caption="12 byte data field" value="1"/>
        <value name="DATA16" caption="16 byte data field" value="2"/>
        <value name="DATA20" caption="20 byte data field" value="3"/>
        <value name="DATA24" caption="24 byte data field" value="4"/>
        <value name="DATA32" caption="32 byte data field" value="5"/>
        <value name="DATA48" caption="48 byte data field" value="6"/>
        <value name="DATA64" caption="64 byte data field" value="7"/>
      </value-group>
      <value-group name="CAN_SIDFE_0__SFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="CAN_SIDFE_0__SFT">
        <value name="RANGE" caption="Range filter from SFID1 to SFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for SFID1 or SFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
      </value-group>
      <value-group name="CAN_TXEFE_1__ET">
        <value name="TXE" caption="Tx event" value="1"/>
        <value name="TXC" caption="Transmission in spite of cancellation" value="2"/>
      </value-group>
      <value-group name="CAN_XIDFE_0__EFEC">
        <value name="DISABLE" caption="Disable filter element" value="0"/>
        <value name="STF0M" caption="Store in Rx FIFO 0 if filter match" value="1"/>
        <value name="STF1M" caption="Store in Rx FIFO 1 if filter match" value="2"/>
        <value name="REJECT" caption="Reject ID if filter match" value="3"/>
        <value name="PRIORITY" caption="Set priority if filter match" value="4"/>
        <value name="PRIF0M" caption="Set priority and store in FIFO 0 if filter match" value="5"/>
        <value name="PRIF1M" caption="Set priority and store in FIFO 1 if filter match" value="6"/>
        <value name="STRXBUF" caption="Store into Rx Buffer" value="7"/>
      </value-group>
      <value-group name="CAN_XIDFE_1__EFT">
        <value name="RANGEM" caption="Range filter from EFID1 to EFID2" value="0"/>
        <value name="DUAL" caption="Dual ID filter for EFID1 or EFID2" value="1"/>
        <value name="CLASSIC" caption="Classic filter" value="2"/>
        <value name="RANGE" caption="Range filter from EFID1 to EFID2 with no XIDAM mask" value="3"/>
      </value-group>
    </module>
    <module name="CCL" id="03718" name2="cla_ccl_u2225_v2" version="2b0" caption="Configurable Custom Logic">
      <register-group name="CCL" caption="Configurable Custom Logic">
        <register name="CTRL" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1" values="CCL_CTRL__SWRST"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2" values="CCL_CTRL__ENABLE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40" values="CCL_CTRL__RUNSTDBY"/>
        </register>
        <register name="SEQCTRL" offset="0x4" rw="RW" size="1" count="2" initval="0x00" caption="SEQ Control x">
          <bitfield name="SEQSEL" caption="Sequential Selection" mask="0xF" values="CCL_SEQCTRL__SEQSEL"/>
        </register>
        <register name="LUTCTRL" offset="0x8" rw="RW" size="4" count="4" initval="0x00000000" caption="LUT Control x">
          <bitfield name="ENABLE" caption="LUT Enable" mask="0x2" values="CCL_LUTCTRL__ENABLE"/>
          <bitfield name="FILTSEL" caption="Filter Selection" mask="0x30" values="CCL_LUTCTRL__FILTSEL"/>
          <bitfield name="EDGESEL" caption="Edge Selection" mask="0x80" values="CCL_LUTCTRL__EDGESEL"/>
          <bitfield name="INSEL0" caption="Input Selection 0" mask="0xF00" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL1" caption="Input Selection 1" mask="0xF000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INSEL2" caption="Input Selection 2" mask="0xF0000" values="CCL_LUTCTRL__INSEL"/>
          <bitfield name="INVEI" caption="Inverted Event Input Enable" mask="0x100000" values="CCL_LUTCTRL__INVEI"/>
          <bitfield name="LUTEI" caption="LUT Event Input Enable" mask="0x200000" values="CCL_LUTCTRL__LUTEI"/>
          <bitfield name="LUTEO" caption="LUT Event Output Enable" mask="0x400000" values="CCL_LUTCTRL__LUTEO"/>
          <bitfield name="TRUTH" caption="Truth Value" mask="0xFF000000"/>
        </register>
      </register-group>
      <value-group name="CCL_CTRL__SWRST">
        <value name="DISABLE" caption="The peripheral is not reset" value="0"/>
        <value name="ENABLE" caption="The peripheral is reset" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__ENABLE">
        <value name="DISABLE" caption="The peripheral is disabled" value="0"/>
        <value name="ENABLE" caption="The peripheral is enabled" value="1"/>
      </value-group>
      <value-group name="CCL_CTRL__RUNSTDBY">
        <value name="DISABLE" caption="Generic clock is not required in standby sleep mode" value="0"/>
        <value name="ENABLE" caption="Generic clock is  required in standby sleep mode" value="1"/>
      </value-group>
      <value-group name="CCL_SEQCTRL__SEQSEL">
        <value name="DISABLE" caption="Sequential logic is disabled" value="0"/>
        <value name="DFF" caption="D flip flop" value="1"/>
        <value name="JK" caption="JK flip flop" value="2"/>
        <value name="LATCH" caption="D latch" value="3"/>
        <value name="RS" caption="RS latch" value="4"/>
      </value-group>
      <value-group name="CCL_LUTCTRL__ENABLE">
        <value name="DISABLE" caption="LUT block is disabled" value="0"/>
        <value name="ENABLE" caption="LUT block is enabled" value="1"/>
      </value-group>
