Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK0512GC01100.atdf
        <register name="BUSYCH" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
          <bitfield name="BUSYCH8" caption="Busy Channel 8" mask="0x100"/>
          <bitfield name="BUSYCH9" caption="Busy Channel 9" mask="0x200"/>
          <bitfield name="BUSYCH10" caption="Busy Channel 10" mask="0x400"/>
          <bitfield name="BUSYCH11" caption="Busy Channel 11" mask="0x800"/>
        </register>
        <register name="READYUSR" offset="0x1C" rw="R" size="4" initval="0xFFFFFFFF" caption="Ready Users">
          <bitfield name="READYUSR0" caption="Ready User for Channel 0" mask="0x1"/>
          <bitfield name="READYUSR1" caption="Ready User for Channel 1" mask="0x2"/>
          <bitfield name="READYUSR2" caption="Ready User for Channel 2" mask="0x4"/>
          <bitfield name="READYUSR3" caption="Ready User for Channel 3" mask="0x8"/>
          <bitfield name="READYUSR4" caption="Ready User for Channel 4" mask="0x10"/>
          <bitfield name="READYUSR5" caption="Ready User for Channel 5" mask="0x20"/>
          <bitfield name="READYUSR6" caption="Ready User for Channel 6" mask="0x40"/>
          <bitfield name="READYUSR7" caption="Ready User for Channel 7" mask="0x80"/>
          <bitfield name="READYUSR8" caption="Ready User for Channel 8" mask="0x100"/>
          <bitfield name="READYUSR9" caption="Ready User for Channel 9" mask="0x200"/>
          <bitfield name="READYUSR10" caption="Ready User for Channel 10" mask="0x400"/>
          <bitfield name="READYUSR11" caption="Ready User for Channel 11" mask="0x800"/>
        </register>
        <register-group name="CHANNEL" name-in-module="CHANNEL" offset="0x020" size="0x8" count="32"/>
        <register name="USER" offset="0x120" rw="RW" size="1" count="104" initval="0x00" caption="User Multiplexer n">
          <bitfield name="CHANNEL" caption="Channel Event Selection" mask="0x3F"/>
        </register>
      </register-group>
      <value-group name="EVSYS_CHANNEL__PATH">
        <value name="ASYNCHRONOUS" caption="Asynchronous path" value="0x0"/>
        <value name="RESYNCHRONIZED" caption="Resynchronized path" value="0x1"/>
      </value-group>
      <value-group name="EVSYS_CHANNEL__EDGSEL">
        <value name="NO_EVT_OUTPUT" caption="No event output when using the resynchronized or synchronous path" value="0"/>
        <value name="RISING_EDGE" caption="Event detection only on the rising edge of the signal from the event generator when using the resynchronized or synchronous path" value="1"/>
        <value name="FALLING_EDGE" caption="Event detection only on the falling edge of the signal from the event generator when using the resynchronized or synchronous path" value="2"/>
        <value name="BOTH_EDGES" caption="Event detection on rising and falling edges of the signal from the event generator when using the resynchronized or synchronous path" value="3"/>
      </value-group>
    </module>
    <module name="FCR" id="03438" name2="pfm_ctrlr_apb_v1" version="1b0" caption="Flash Read Controller (FCR)">
      <register-group name="FCR" caption="Flash Read Controller (FCR)">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00008000" caption="Control A Register">
          <bitfield name="ARB" caption="AHB Arbitration scheme" mask="0x4"/>
          <bitfield name="FWS" caption="Flash Access Time Defined in terms of AHB Clock Wait States" mask="0xF00"/>
          <bitfield name="ADRWS" caption="Address Wait State Enable" mask="0x4000"/>
          <bitfield name="AUTOWS" caption="Automatic Wait State Enable." mask="0x8000"/>
          <bitfield name="RDBUFWS" caption="Data returned from the Read Buffer match the Flash Wait States" mask="0xF0000"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Control B Register">
          <bitfield name="PRM" caption="Set NVM Power Reduction Mode" mask="0x1"/>
          <bitfield name="TEMP" caption="NVM Operating Temperature Read Mode" mask="0x2"/>
          <bitfield name="SLP" caption="NVM Power Reduction Mode selection during System Standby Sleep" mask="0x300"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear Register">
          <bitfield name="SERR" caption="Flash SEC Interrupt Clear Enable" mask="0x1"/>
          <bitfield name="DERR" caption="ECC Double Error Detected Clear Enable" mask="0x2"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Clear Enable" mask="0x100"/>
          <bitfield name="CRCERR" caption="CRC Error Clear Enable" mask="0x200"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Clear Enable" mask="0x10000"/>
        </register>
        <register name="INTENSET" offset="0xC" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable SET Register">
          <bitfield name="SERR" caption="Flash Single Error Corrected Set Enable" mask="0x1"/>
          <bitfield name="DERR" caption="ECC Double Error Detected Set Enable" mask="0x2"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Set Enable" mask="0x100"/>
          <bitfield name="CRCERR" caption="CRC Error Interrupt Set Enable" mask="0x200"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Interrupt Set Enable" mask="0x10000"/>
        </register>
        <register name="INTFLAG" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Register">
          <bitfield name="SERR" caption="Flash Single Error Corrected Flag" mask="0x1"/>
          <bitfield name="DERR" caption="ECC Double Error Detected Flag" mask="0x2"/>
          <bitfield name="CRCDONE" caption="CRC Calculation Done Flag" mask="0x100"/>
          <bitfield name="CRCERR" caption="CRC Error Flag" mask="0x200"/>
          <bitfield name="FLTCAP" caption="ECC Fault Capture Flag" mask="0x10000"/>
        </register>
        <register name="STATUS" offset="0x14" rw="R" size="4" initval="0x00000000" caption="NVM Status Register">
          <bitfield name="PRM" caption="NVM Power Reduction Mode Status" mask="0x1"/>
          <bitfield name="TEMP" caption="NVM Operating Temperature Read Mode Status" mask="0x2"/>
        </register>
        <register name="DBGCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Debug Control Register">
          <bitfield name="CRCRUN" caption="CRC Debug Run" mask="0x1"/>
          <bitfield name="DBGECC" caption="Debug ECC Mode" mask="0x6"/>
        </register>
        <register name="ECCCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000040" caption="ECC Control Register">
          <bitfield name="ECCCTL" caption="NVM ECC Mode Control- restricts one or more NVMOPs" mask="0x30"/>
          <bitfield name="ECCUNLCK" caption="NVM ECC Mode Control Unlock" mask="0x40"/>
          <bitfield name="SECCNT" caption="Flash SEC Count" mask="0xFF00"/>
        </register>
        <register name="CRCCTRL" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="CRC Control Register">
          <bitfield name="CRCRST" caption="CRC Reset" mask="0x1"/>
          <bitfield name="CRCEN" caption="Start CRC Calculation" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="CRC Run in Standby" mask="0x20"/>
          <bitfield name="PLEN32" caption="Polynomial Length Select" mask="0x1000"/>
          <bitfield name="AUTOR" caption="CRC Auto Repeat" mask="0x2000"/>
          <bitfield name="ROUT" caption="CRC Reflected Output" mask="0x4000"/>
          <bitfield name="RIN" caption="CRC Reflected Input" mask="0x8000"/>
          <bitfield name="PERIOD" caption="Read Period in GCLK counts" mask="0xFFFF0000"/>
        </register>
        <register name="CRCPAUSE" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="CRC PAUSE Register">
          <bitfield name="PAUSE" caption="CRC Pause" mask="0x1"/>
        </register>
        <register name="CRCMADR" offset="0x28" rw="RW" size="4" initval="0x00000000" caption="CRC Message Address Register">
          <bitfield name="CRCMADR" caption="Message Start Address in Flash" mask="0xFFFFFFF"/>
        </register>
