Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK0512GC01100.atdf
        <register name="WPMR" offset="0xE0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Write Protection Mode Register">
          <bitfield name="WPEN" caption="Write Protection Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protection Key" mask="0xFFFFFF00"/>
        </register>
        <register name="WPSR" offset="0xE4" rw="R" size="4" access-size="4" initval="0x00000000" caption="Write Protection Status Register">
          <bitfield name="WPVS" caption="Write Protection Violation Source" mask="0x1"/>
          <bitfield name="WPVSRC" caption="Write Protection Violation Status" mask="0xFFFF00"/>
        </register>
      </register-group>
    </module>
    <module name="PDEC" id="03604" name2="qei_pdec_u2263_v1" version="1b0" caption="Position Decoder">
      <register-group name="PDEC" caption="Position Decoder">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operation Mode" mask="0xC" values="PDEC_CTRLA__MODE"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="CONF" caption="PDEC Configuration" mask="0x700" values="PDEC_CTRLA__CONF"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x800"/>
          <bitfield name="SWAP" caption="PDEC Phase A and B Swap" mask="0x4000"/>
          <bitfield name="PEREN" caption="Period Enable" mask="0x8000"/>
          <bitfield name="PINEN0" caption="PDEC Input From Pin 0 Enable" mask="0x10000"/>
          <bitfield name="PINEN1" caption="PDEC Input From Pin 1 Enable" mask="0x20000"/>
          <bitfield name="PINEN2" caption="PDEC Input From Pin 2 Enable" mask="0x40000"/>
          <bitfield name="PINVEN0" caption="IO Pin 0 Invert Enable" mask="0x100000"/>
          <bitfield name="PINVEN1" caption="IO Pin 1 Invert Enable" mask="0x200000"/>
          <bitfield name="PINVEN2" caption="IO Pin 2 Invert Enable" mask="0x400000"/>
          <bitfield name="ANGULAR" caption="Angular Counter Length" mask="0x7000000"/>
          <bitfield name="MAXCMP" caption="Maximum Consecutive Missing Pulses" mask="0xF0000000"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="PDEC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="CMD" caption="Command" mask="0xE0" values="PDEC_CTRLBSET__CMD"/>
        </register>
        <register name="EVCTRL" offset="0x6" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="EVACT" caption="Event Action" mask="0x3" values="PDEC_EVCTRL__EVACT"/>
          <bitfield name="EVINV" caption="Inverted Event Input Enable" mask="0x1C"/>
          <bitfield name="EVEI" caption="Event Input Enable" mask="0xE0"/>
          <bitfield name="OVFEO" caption="Overflow/Underflow Output Event Enable" mask="0x100"/>
          <bitfield name="ERREO" caption="Error  Output Event Enable" mask="0x200"/>
          <bitfield name="DIREO" caption="Direction Output Event Enable" mask="0x400"/>
          <bitfield name="VLCEO" caption="Velocity Output Event Enable" mask="0x800"/>
          <bitfield name="MCEO0" caption="Match Channel 0 Event Output Enable" mask="0x1000"/>
          <bitfield name="MCEO1" caption="Match Channel 1 Event Output Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="Overflow/Underflow Interrupt Disable" mask="0x1"/>
          <bitfield name="ERR" caption="Error Interrupt Disable" mask="0x2"/>
          <bitfield name="DIR" caption="Direction Interrupt Disable" mask="0x4"/>
          <bitfield name="VLC" caption="Velocity Interrupt Disable" mask="0x8"/>
          <bitfield name="MC0" caption="Channel 0 Compare Match Disable" mask="0x10"/>
          <bitfield name="MC1" caption="Channel 1 Compare Match Disable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="Overflow/Underflow Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="DIR" caption="Direction Interrupt Enable" mask="0x4"/>
          <bitfield name="VLC" caption="Velocity Interrupt Enable" mask="0x8"/>
          <bitfield name="MC0" caption="Channel 0 Compare Match Enable" mask="0x10"/>
          <bitfield name="MC1" caption="Channel 1 Compare Match Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xA" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="Overflow/Underflow" mask="0x1"/>
          <bitfield name="ERR" caption="Error" mask="0x2"/>
          <bitfield name="DIR" caption="Direction Change" mask="0x4"/>
          <bitfield name="VLC" caption="Velocity" mask="0x8"/>
          <bitfield name="MC0" caption="Channel 0 Compare Match" mask="0x10"/>
          <bitfield name="MC1" caption="Channel 1 Compare Match" mask="0x20"/>
        </register>
        <register name="STATUS" offset="0xC" rw="RW" access="RWSYNC" size="2" initval="0x0040" caption="Status">
          <bitfield name="QERR" caption="Quadrature Error Flag" mask="0x1"/>
          <bitfield name="IDXERR" caption="Index Error Flag" mask="0x2"/>
          <bitfield name="MPERR" caption="Missing Pulse Error flag" mask="0x4"/>
          <bitfield name="WINERR" caption="Window Error Flag" mask="0x10"/>
          <bitfield name="HERR" caption="Hall Error Flag" mask="0x20"/>
          <bitfield name="STOP" caption="Stop" mask="0x40"/>
          <bitfield name="DIR" caption="Direction Status Flag" mask="0x80"/>
          <bitfield name="PRESCBUFV" caption="Prescaler Buffer Valid" mask="0x100"/>
          <bitfield name="FILTERBUFV" caption="Filter Buffer Valid" mask="0x200"/>
          <bitfield name="CCBUFV0" caption="Compare Channel 0 Buffer Valid" mask="0x1000"/>
          <bitfield name="CCBUFV1" caption="Compare Channel 1 Buffer Valid" mask="0x2000"/>
        </register>
        <register name="DBGCTRL" offset="0xF" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run Mode" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Synchronization Status">
          <bitfield name="SWRST" caption="Software Reset Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="Control B Synchronization Busy" mask="0x4"/>
          <bitfield name="STATUS" caption="Status Synchronization Busy" mask="0x8"/>
          <bitfield name="PRESC" caption="Prescaler Synchronization Busy" mask="0x10"/>
          <bitfield name="FILTER" caption="Filter Synchronization Busy" mask="0x20"/>
          <bitfield name="COUNT" caption="Count Synchronization Busy" mask="0x40"/>
          <bitfield name="CC0" caption="Compare Channel 0 Synchronization Busy" mask="0x80"/>
          <bitfield name="CC1" caption="Compare Channel 1 Synchronization Busy" mask="0x100"/>
        </register>
